# vstGetDataReal

## Description
```pascal
PROCEDURE vstGetDataReal(
				inDataID    : LONGINT;
				VAR outData : REAL;
				VAR result  : BOOLEAN);
```

```python

def vs.vstGetDataReal(inDataID):
    return (outData, result)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inDataID|LONGINT||
|outData|REAL||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events